In [4]:
import pandas as pd

In [17]:
# Open the file
with open('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt', 'r') as fp:
    print(fp)

<_io.TextIOWrapper name='C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt' mode='r' encoding='cp1252'>

In [19]:
with open ('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt', 'r') as fp:
    for index, line in enumerate(fp.readlines()):
        if (index < 10):
            print(index, line)

0 2/4/17 0:00,1099.169125

1 3/4/17 0:00,1141.813

2 4/4/17 0:00,?

3 5/4/17 0:00,1133.079314

4 6/4/17 0:00,-

5 7/4/17 0:00,-

6 8/4/17 0:00,1181.149838

7 9/4/17 0:00,1208.8005

8 10/4/17 0:00,1207.744875

9 11/4/17 0:00,1226.617038

In [24]:
with open ('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt', 'r') as fp:
    for index, line in enumerate(fp.readlines()):
        # read just first 10 lines
        if (index < 10):
            timestamp, price = line.split(',')
            print(f"{timestamp}: ${price}")

2/4/17 0:00: $1099.169125

3/4/17 0:00: $1141.813

4/4/17 0:00: $?

5/4/17 0:00: $1133.079314

6/4/17 0:00: $-

7/4/17 0:00: $-

8/4/17 0:00: $1181.149838

9/4/17 0:00: $1208.8005

10/4/17 0:00: $1207.744875

11/4/17 0:00: $1226.617038

CSV modul

In [42]:
import csv

In [48]:
with open('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt', 'r') as fp:
    reader = csv.reader(fp)
    for index, (timestamp, price) in enumerate(reader):
        if (index <10):
            print(f"{timestamp}: ${price}")

2/4/17 0:00: $1099.169125
3/4/17 0:00: $1141.813
4/4/17 0:00: $?
5/4/17 0:00: $1133.079314
6/4/17 0:00: $-
7/4/17 0:00: $-
8/4/17 0:00: $1181.149838
9/4/17 0:00: $1208.8005
10/4/17 0:00: $1207.744875
11/4/17 0:00: $1226.617038

with open ('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/btc-market-price.txt', 'r') as fp:
    reader = txt.reader(fp)
    for index, (timestamp, price) in enumerate(reader):
        if (index < 10):
            print(f"{timestamp}: ${price}")

with open('C:/Users/Dragan Golic/Python Projects/Data Analysis/data/exam_review.txt', 'r') as fp:
    reader = csv.reader(fp)
    next(reader) # skipping header
    for index, values in enumerate(reader):
        if not values:
            continue # skip empty lines
        fname, lname, age, math, franch = values
        print(f"{fname} {lname} (age {age}) got {math} in Math and {franch} in Franch")

Reading data with Pandas

In [52]:
# pd.read_csv?

In [53]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"
pd.read_csv(csv_url).head()

  Country Name Country Code  Year         Value
0   Arab World          ARB  1968  2.576068e+10
1   Arab World          ARB  1969  2.843420e+10
2   Arab World          ARB  1970  3.138550e+10
3   Arab World          ARB  1971  3.642691e+10
4   Arab World          ARB  1972  4.331606e+10

In [55]:
# local file
#df = pd.read_csv('btc-market-price.csv')
#df.head()

Fist row behaviour with header parameter

In [58]:
csv_url = "https://raw.githubusercontent.com/datasets/gdp/master/data/gdp.csv"
pd.read_csv(csv_url, header=None)

                  0             1     2                 3
0      Country Name  Country Code  Year             Value
1        Arab World           ARB  1968  25760683041.0857
2        Arab World           ARB  1969  28434203615.4829
3        Arab World           ARB  1970  31385499664.0672
4        Arab World           ARB  1971  36426909888.3928
...             ...           ...   ...               ...
11503      Zimbabwe           ZWE  2012  14242490252.4289
11504      Zimbabwe           ZWE  2013  15451768658.5469
11505      Zimbabwe           ZWE  2014  15891049235.9908
11506      Zimbabwe           ZWE  2015  16304667807.0657
11507      Zimbabwe           ZWE  2016  16619960401.9038

[11508 rows x 4 columns]

Missing values with na_values parameter

In [61]:
df =pd.read_csv(csv_url, header=None, na_values=['', '?', '-'])
df.head()

              0             1     2                 3
0  Country Name  Country Code  Year             Value
1    Arab World           ARB  1968  25760683041.0857
2    Arab World           ARB  1969  28434203615.4829
3    Arab World           ARB  1970  31385499664.0672
4    Arab World           ARB  1971  36426909888.3928

Column names using names parameter

In [62]:
df =pd.read_csv(csv_url, header=None, na_values=['', '?', '-'], names=['Country Code', 'Year'])
df.head()

                          Country Code              Year
Country Name Country Code         Year             Value
Arab World   ARB                  1968  25760683041.0857
             ARB                  1969  28434203615.4829
             ARB                  1970  31385499664.0672
             ARB                  1971  36426909888.3928

In [63]:
df.info()

<class 'pandas.core.frame.DataFrame'>
MultiIndex: 11508 entries, ('Country Name', 'Country Code') to ('Zimbabwe', 'ZWE')
Data columns (total 2 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   Country Code  11508 non-null  object
 1   Year          11508 non-null  object
dtypes: object(2)
memory usage: 245.0+ KB

Column types using dtype parameter

In [65]:
df =pd.read_csv(csv_url, header=None, na_values=['', '?', '-'], names=['Country Code', 'Year'], dtype={'Price': 'float'})
df.head()

                          Country Code              Year
Country Name Country Code         Year             Value
Arab World   ARB                  1968  25760683041.0857
             ARB                  1969  28434203615.4829
             ARB                  1970  31385499664.0672
             ARB                  1971  36426909888.3928

In [66]:
df.dtypes

Country Code    object
Year            object
dtype: object

In [72]:
# parsing the time
#pd.to_datetime(df['Year']).head()

Date parser using parse_dates parameter

In [73]:
df =pd.read_csv(csv_url, header=None, na_values=['', '?', '-'], names=['Country Code', 'Year'], parse_dates=[0])
df.head()

                          Country Code              Year
Country Name Country Code         Year             Value
Arab World   ARB                  1968  25760683041.0857
             ARB                  1969  28434203615.4829
             ARB                  1970  31385499664.0672
             ARB                  1971  36426909888.3928

In [74]:
df.dtypes

Country Code    object
Year            object
dtype: object

Adding index to our data using index_col parameter

In [78]:
#df =pd.read_csv(csv_url, header=None, na_values=['', '?', '-'], names=['Country Code', 'Year'], parse_dates=[0], index_col=[0])
df.head()

                          Country Code              Year
Country Name Country Code         Year             Value
Arab World   ARB                  1968  25760683041.0857
             ARB                  1969  28434203615.4829
             ARB                  1970  31385499664.0672
             ARB                  1971  36426909888.3928

In [ ]:
A more challenging parsing

In [23]:
import pandas as pd

In [24]:
csv_url = "https://github.com/ine-rmotr-curriculum/RDP-Reading-Data-with-Python-and-Pandas/raw/master/unit-1-reading-data-with-python-and-pandas/lesson-1-reading-csv-and-txt-files/files/exam_review.csv"

In [25]:
exam_df = pd.read_csv(csv_url)
exam_df

                               first_name>last_name>age>math_score>french_score
Ray>Morley>18>"68     000">"75                                             000"
Melvin>Scott>24>77>83 NaN                                                   NaN
Amirah>Haley>22>92>67 NaN                                                   NaN
Gerard>Mills>19>"78   000">72                                               NaN
Amy>Grimes>23>91>81   NaN                                                   NaN

Custom data delimiters using sep parameter

In [26]:
exam_df = pd.read_csv(csv_url, sep='>')
exam_df

  first_name last_name  age math_score french_score
0        Ray    Morley   18     68,000       75,000
1     Melvin     Scott   24         77           83
2     Amirah     Haley   22         92           67
3     Gerard     Mills   19     78,000           72
4        Amy    Grimes   23         91           81

Custom numeric decimal and thousands character

In [27]:
exam_df[['math_score', 'french_score']].dtypes

math_score      object
french_score    object
dtype: object

In [28]:
exam_df = pd.read_csv(csv_url, sep='>', decimal=',')
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18        68.0          75.0
1     Melvin     Scott   24        77.0          83.0
2     Amirah     Haley   22        92.0          67.0
3     Gerard     Mills   19        78.0          72.0
4        Amy    Grimes   23        91.0          81.0

In [29]:
exam_df[['math_score', 'french_score']].dtypes

math_score      float64
french_score    float64
dtype: object

What happens with thousands parameter

In [30]:
exam_df = pd.read_csv(csv_url, sep='>', thousands=',')
exam_df

  first_name last_name  age  math_score  french_score
0        Ray    Morley   18       68000         75000
1     Melvin     Scott   24          77            83
2     Amirah     Haley   22          92            67
3     Gerard     Mills   19       78000            72
4        Amy    Grimes   23          91            81

In [31]:
exam_df[['math_score', 'french_score']].dtypes

math_score      int64
french_score    int64
dtype: object

Excluding specific rows

In [32]:
exam_df = pd.read_csv(csv_url, sep='>', skiprows=2)
exam_df

   Melvin   Scott  24      77  83
0  Amirah   Haley  22      92  67
1  Gerard   Mills  19  78,000  72
2     Amy  Grimes  23      91  81

In [33]:
# Header is first row, to skip rows 1 and 3

In [34]:
exam_df = pd.read_csv(csv_url, sep='>', skiprows=[1, 3])
exam_df

  first_name last_name  age math_score  french_score
0     Melvin     Scott   24         77            83
1     Gerard     Mills   19     78,000            72
2        Amy    Grimes   23         91            81

Get rid of blank lines

In [35]:
exam_df = pd.read_csv(csv_url, sep='>', skip_blank_lines=False)
exam_df

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

Using a Series instead of DataFrame

In [42]:
exam_test_1 = pd.read_csv(csv_url, sep='>', usecols=['last_name'])
exam_test_1

  last_name
0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes

In [43]:
type(exam_test_1)

pandas.core.frame.DataFrame

In [44]:
exam_test_2 = pd.read_csv(csv_url, sep='>', usecols=['last_name'], squeeze=True)
exam_test_2

C:\Users\Dragan Golic\AppData\Local\Temp\ipykernel_7176\235005058.py:1: FutureWarning: The squeeze argument has been deprecated and will be removed in a future version. Append .squeeze("columns") to the call to squeeze.


  exam_test_2 = pd.read_csv(csv_url, sep='>', usecols=['last_name'], squeeze=True)

0    Morley
1     Scott
2     Haley
3     Mills
4    Grimes
Name: last_name, dtype: object

In [45]:
type(exam_test_2)

pandas.core.series.Series

Save to CSV file

In [46]:
exam_df

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81

In [47]:
exam_df.to_csv()

',first_name,last_name,age,math_score,french_score\r\n0,Ray,Morley,18.0,"68,000","75,000"\r\n1,Melvin,Scott,24.0,77,83\r\n2,Amirah,Haley,22.0,92,67\r\n3,,,,,\r\n4,Gerard,Mills,19.0,"78,000",72\r\n5,Amy,Grimes,23.0,91,81\r\n'

In [50]:
exam_df.to_csv('out.csv')

In [51]:
pd.read_csv('out.csv')

   Unnamed: 0 first_name last_name   age math_score french_score
0           0        Ray    Morley  18.0     68,000       75,000
1           1     Melvin     Scott  24.0         77           83
2           2     Amirah     Haley  22.0         92           67
3           3        NaN       NaN   NaN        NaN          NaN
4           4     Gerard     Mills  19.0     78,000           72
5           5        Amy    Grimes  23.0         91           81

In [52]:
exam_df.to_csv('out.csv', index=None)

In [53]:
pd.read_csv('out.csv')

  first_name last_name   age math_score french_score
0        Ray    Morley  18.0     68,000       75,000
1     Melvin     Scott  24.0         77           83
2     Amirah     Haley  22.0         92           67
3        NaN       NaN   NaN        NaN          NaN
4     Gerard     Mills  19.0     78,000           72
5        Amy    Grimes  23.0         91           81